{
    "me": {
        "my_name": "Валерий Геринг",
        "my_address": "Ален, Германия"
    },
    "languages": {
        "en": "Английский",
        "de": "Немецкий",
        "ru": "Русский"
    },
    "nav": {
        "home": "Главная",
        "about": "Обо мне",
        "service": "Услуги",
        "skills": "Навыки",
        "projects": "Проекты",
        "contact": "Контакты",
        "Portfo": "Портфо",
        "lio.": "лио."
    },
    "home": {
        "Hello, my name is": "Привет, меня зовут",
        "And I'm a": "И я",
        "roles": ["разработчик", "фрилансер", "дизайнер"]
    },
    "about": {
        "About me": "Обо мне",
        "who i am": "Кто я",
        "I'm Valerii and I'm a": "Я Валерий и я",
        "about_text": "Привет, меня зовут Валерий, я фронтенд-разработчик из Алена, Германия. Я создаю качественные веб-сайты и веб-приложения с акцентом на чистый код и современные технологии. У меня сильные навыки в HTML, CSS, JavaScript, React, Redux и Node.js, и я активно работаю с интеграцией API и современными инструментами разработки. Изучите мой профиль и проекты на этом сайте, чтобы лучше понять, кто я и чем занимаюсь."
    },
    "service": {
        "My Service": "Мои услуги",
        "what i provide": "Что я предлагаю",
        "Web Development": "Веб-разработка",
        "Web Design": "Веб-дизайн",
        "Responsive Design": "Адаптивный дизайн"
    },
    "skills": {
        "My Skills": "Мои навыки",
        "what i know": "Что я умею",
        "My creative skills & experience": "Мои навыки и опыт",
        "Languages": "Языки",
        "Libraries & frameworks": "Библиотеки и фреймворки"
    },
    "projects": {
        "My Projects": "Мои проекты",
        "what can i do": "Что я могу"
    },
    "contact": {
        "Contact me": "Свяжитесь со мной",
        "get in touch": "Связаться",
        "Get in Touch": "Связаться",
        "contact_text": "Не стесняйтесь задать свой вопрос здесь, и я отвечу в течение дня. Пожалуйста, укажите ваши контактные данные.",
        "Name": "Имя",
        "Address": "Адрес",
        "Email": "Почта",
        "Message Me": "Написать сообщение",
        "Message": "Сообщение",
        "Phone": "Телефон"
    },
    "footer": {
        "Created by": "Создано",
        "Valerii Hering": "Валерием Геринг",
        "All rights reserved": "Все права защищены"
    },
    "githubModal": {
        "CHOOSE REPOSITORY": "ВЫБРАТЬ РЕПОЗИТАРИЙ"
    },
    "filter": {
        "All Projects": "Все проекты",
        "React": "React",
        "Frontend": "Фронтенд",
        "Fullstack": "Фуллстек"
    },
    "projects_data": {
        "events_calendar": {
        "title": "Календарь событий",
        "description": "Планировщик событий, созданный на React и Node.js. Пользователи могут добавлять, редактировать и просматривать события в удобном и интерактивном календаре.",
        "features": {
            "api_integration": {
            "title": "Интеграция API",
            "description": "Бесшовно подключается к RESTful API, обеспечивая динамическое получение данных и обновления в реальном времени."
            },
            "database_support": {
            "title": "Поддержка базы данных",
            "description": "Работает на MongoDB, обеспечивая надежное, масштабируемое и высокопроизводительное хранение и запрос данных."
            },
            "user_security": {
            "title": "Безопасность",
            "description": "Включает безопасный вход и выход из аккаунта. Каждый пользователь может управлять только своими личными заметками."
            },
            "fully_responsive": {
            "title": "Полная адаптивность",
            "description": "Адаптивная верстка обеспечивает удобный и плавный опыт на смартфонах, планшетах и компьютерах."
            }
        }
        },

        "weather_website": {
        "title": "Сайт погоды",
        "description": "Адаптивное приложение погоды с данными в реальном времени. Пользователь может искать города и просматривать подробные прогнозы.",
        "features": {
            "api_integration": {
            "title": "Интеграция API",
            "description": "Получает точные данные о погоде в реальном времени через OpenWeather API."
            },
            "interactive_map": {
            "title": "Интерактивная карта",
            "description": "Отображает погодные условия по всему миру с отслеживанием местоположения и динамическими визуальными элементами."
            },
            "visual_charts": {
            "title": "Графики и визуализация",
            "description": "Показывает изменения температуры, ветра и давления с помощью плавных и информативных графиков."
            },
            "fast_performance": {
            "title": "Высокая производительность",
            "description": "Оптимизированные React-компоненты обеспечивают быстрое отображение, малые задержки и отзывчивый интерфейс."
            }
        }
        },

        "foodies": {
        "title": "Foodies",
        "description": "Приложение для поиска рецептов с использованием внешнего API. Пользователи могут находить, фильтровать и сохранять любимые блюда для дальнейшего приготовления.",
        "features": {
            "smart_cart": {
            "title": "Умная корзина",
            "description": "Позволяет легко добавлять, удалять и управлять блюдами через корзину, работающую на Redux для плавного управления состоянием."
            },
            "secure_payment": {
            "title": "Безопасная оплата",
            "description": "Интегрировано со Stripe для быстрого, безопасного и стабильного проведения онлайн-платежей."
            },
            "user_account": {
            "title": "Аккаунт пользователя",
            "description": "Включает регистрацию, вход и выход из аккаунта для персонализированных покупок и отслеживания заказов."
            },
            "fully_responsive": {
            "title": "Полная адаптивность",
            "description": "Создано для комфортной и интуитивной работы на компьютерах, планшетах и мобильных устройствах."
            }
        }
        },

        "yoga_website": {
        "title": "Сайт йоги",
        "description": "Плавный и адаптивный сайт йоги, демонстрирующий занятия, инструкторов и расписание в современном спокойном стиле.",
        "features": {
            "api_integration": {
            "title": "Интеграция API",
            "description": "Беспроблемно соединяется с RESTful API, обеспечивая динамические данные и обновления в реальном времени."
            },
            "database_support": {
            "title": "Поддержка базы данных",
            "description": "Работает на MongoDB, обеспечивая надежное, стабильное и высокопроизводительное хранение данных."
            },
            "fully_responsive": {
            "title": "Полная адаптивность",
            "description": "Гибкая верстка обеспечивает комфортное использование сайта на смартфонах, планшетах и настольных компьютерах."
            },
            "fast_performance": {
            "title": "Высокая производительность",
            "description": "Оптимизированные React-компоненты обеспечивают молниеносную загрузку и плавное взаимодействие с пользователем."
            }
        }
        },
        "recipes": {
            "title": "Приложение рецептов",
            "description": "Приложение для поиска и изучения рецептов со всего мира. Ищите блюда по ингредиентам, просматривайте инструкции и добавляйте любимые рецепты.",
            "features": {
                "api": {
                "title": "Интеграция API",
                "description": "Подключается к REST API Edamam и получает тысячи рецептов с актуальной нутриционной информацией."
                },
                "search": {
                "title": "Умный поиск",
                "description": "Позволяет искать рецепты по любому запросу — от «авокадо» до «шоколадного торта». Результаты отображаются сразу."
                },
                "nutrition": {
                "title": "Пищевая ценность",
                "description": "Показывает подробный состав блюда: калории, белки, углеводы и жиры."
                },
                "responsive": {
                "title": "Адаптивный дизайн",
                "description": "Интерфейс плавно подстраивается под любое устройство — телефон, планшет или компьютер."
                }
            }
            },

            "splitBill": {
            "title": "Калькулятор счёта",
            "description": "Интерактивное приложение для удобного разделения расходов. Введите сумму, количество людей и чаевые — и получите расчёт доли каждого.",
            "features": {
                "smartSplit": {
                "title": "Умный расчёт",
                "description": "Автоматически считает долю каждого участника с учётом чаевых. Разделить счёт становится очень просто."
                },
                "tipOptions": {
                "title": "Опции чаевых",
                "description": "Выберите один из предложенных процентов чаевых или оставьте без чаевых — всё обновляется мгновенно."
                },
                "alerts": {
                "title": "Уведомления об ошибках",
                "description": "Встроенная валидация подскажет, если данные введены некорректно."
                },
                "responsive": {
                "title": "Полная адаптивность",
                "description": "Приложение удобно использовать на любом устройстве: телефоне, планшете или компьютере."
                }
            }
            },

            "christmas": {
            "title": "С Рождеством!",
            "description": "Праздничный сайт с анимациями, огоньками и новогодней атмосферой. Создан для настроения и поздравлений.",
            "features": {
                "countdown": {
                "title": "Обратный отсчёт",
                "description": "Показывает оставшееся время до Нового года, автоматически обновляется каждый год и отображает праздничное сообщение ещё 3 дня после праздника."
                },
                "music": {
                "title": "Музыкальный плеер",
                "description": "Встроенный аудиоплеер с кнопками воспроизведения, паузы и переключения треков — классические рождественские мелодии."
                },
                "snow": {
                "title": "Падающий снег",
                "description": "Анимация снежинок на частицах Particles.js создаёт уютную зимнюю атмосферу."
                },
                "responsive": {
                "title": "Полная адаптивность",
                "description": "Сайт корректно отображается на любых устройствах."
                }
            }
            },

            "clock": {
            "title": "Приложение часов",
            "tech": "HTML | CSS | JavaScript",
            "description": "Простые цифровые часы с плавной анимацией. Показывают текущее время в минималистичном современном интерфейсе.",
            "features": {
                "analogDigital": {
                "title": "Аналоговые и цифровые часы",
                "description": "Отображает время в двух видах: аналоговый циферблат со стрелками и цифровой формат (часы, минуты, AM/PM)."
                },
                "date": {
                "title": "Текущая дата",
                "description": "Показывает день недели, месяц и год. Обновляется автоматически каждую секунду."
                },
                "theme": {
                "title": "Светлая/тёмная тема",
                "description": "Переключение темы с сохранением выбранного варианта в localStorage."
                },
                "responsive": {
                "title": "Адаптивный дизайн",
                "description": "Интерфейс работает корректно на любых устройствах и сохраняет удобочитаемость."
                }
            }
            },

            "stopwatch": {
            "title": "Секундомер",
            "tech": "HTML | CSS | JavaScript",
            "description": "Веб-секундомер с функциями старта, паузы и сброса. Максимально простой и удобный для точного измерения времени.",
            "features": {
                "precision": {
                "title": "Точная работа",
                "description": "Запускайте, останавливайте и сбрасывайте секундомер с миллисекундной точностью."
                },
                "laps": {
                "title": "Отсечка кругов",
                "description": "Позволяет записывать несколько кругов. Каждый круг отображается в отдельной строке."
                },
                "analogDigital": {
                "title": "Цифровой дисплей",
                "description": "Круговой индикатор и цифровое отображение времени работают синхронно."
                },
                "responsive": {
                "title": "Полная адаптивность",
                "description": "Корректно работает на всех экранах, обеспечивая плавный и удобный интерфейс."
                }
            }
        },
        "form": {
            "title": "Форма",
            "description": "Адаптивное приложение формы, подключенное к Node.js бэкенду. Сохраняет отправленные данные безопасно в подключенной базе данных.",
            "features": {
                "backendIntegration": {
                    "title": "Интеграция с бэкендом",
                    "description": "Создано с использованием Express.js для обработки HTTP-запросов, обработки отправки форм и управления серверной логикой."
                },
                "mongoStorage": {
                    "title": "Хранение в MongoDB",
                    "description": "Сохраняет сообщения пользователей в коллекции MongoDB для надежного и безопасного хранения данных."
                },
                "secureHandling": {
                    "title": "Безопасная обработка данных",
                    "description": "Все данные формы проходят проверку и безопасную обработку перед сохранением, предотвращая распространенные уязвимости."
                },
                "emailCapture": {
                    "title": "Сбор email",
                    "description": "Собирает и сохраняет действительные email-адреса пользователей для последующей коммуникации или уведомлений."
                }
            }
        },

        "todo": {
            "title": "Список дел",
            "description": "Простое приложение для управления задачами, созданное с React. Добавляйте, удаляйте и отмечайте задачи как выполненные с плавными и чистыми взаимодействиями.",
            "features": {
                "api": {
                    "title": "Интеграция API",
                    "description": "Беспрепятственно подключается к RESTful API, обеспечивая динамическую загрузку данных и обновления в реальном времени."
                },
                "database": {
                    "title": "Поддержка базы данных",
                    "description": "Использует MongoDB для надежного, масштабируемого и высокопроизводительного хранения и обработки данных."
                },
                "taskManagement": {
                    "title": "Управление задачами",
                    "description": "Легко добавляйте, редактируйте и удаляйте задачи с мгновенными обновлениями интерфейса. Поддерживает организованный и эффективный список дел."
                },
                "responsive": {
                    "title": "Адаптивный дизайн",
                    "description": "Адаптивные макеты обеспечивают одинаково удобный опыт на смартфонах, планшетах и десктопах."
                }
            }
        },

        "quiz": {
            "title": "Викторина",
            "description": "Интерактивная игра-викторина, где пользователи отвечают на вопросы с ограничением по времени. Отслеживает очки и показывает результаты динамически.",
            "features": {
                "countdown": {
                    "title": "Обратный отсчет",
                    "description": "Отслеживает оставшееся время викторины в реальном времени. Викторина автоматически заканчивается, когда время истекает."
                },
                "score": {
                    "title": "Отслеживание очков",
                    "description": "Автоматически подсчитывает правильные ответы и отображает итоговый результат в конце викторины."
                },
                "navigation": {
                    "title": "Навигация по вопросам",
                    "description": "Плавно загружает следующий вопрос после отправки, показывая текущий номер вопроса и общее количество вопросов."
                },
                "alerts": {
                    "title": "Интерактивные уведомления",
                    "description": "Показывает удобные уведомления о таймауте, завершении викторины и ошибках, с возможностью перезапуска или продолжения."
                }
            }
        }
    },
    "buttons": {
        "contact_me": "Связаться",
        "scroll_down": "Прокрутить",
        "learn_more": "Узнать больше",
        "go_back": "Назад",
        "send_message": "Отправить",
        "sending": "Отправка...",
        "download_cv": "Скачать резюме",
        "website": "Открыть сайт",
        "frontend": "Фронтенд",
        "backend": "Бэкенд",
        "filter": "Фильтр"
    },
    "input": {
        "Ex. John Doe": "Нап.: Иван Иванов",
        "Enter here...": "Введите здесь..."
    }
}
